Documents/гф_СпецификацияПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>гф_СпецификацияПокупателя</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаказыКлиентов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказКлиента</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПоступлениеБезналичныхДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПоступлениеБезналичныхДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/гф_СпецификацияПокупателя/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

// #wortmann {
// #Спецификация покупателя
// Галфинд Окунев 2022/07/05
//
// Параметры:
//
//   Отказ  		 - Булево
//   РежимПроведения - РежимПроведенияДокумента.
//
&После("ОбработкаПроведения")
Процедура гф_ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
	МассивОтличий = ПроверитьСтатусыЗаказов(ПредопределенноеЗначение("Справочник.гф_СтатусРаботыСЗаказомИ5.Подтвержден"));
	
	Если МассивОтличий.Количество() > 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В спецификации не все заказы имели статус «Подтвержден»:");
		
		Для Каждого Отличие Из МассивОтличий Цикл
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Отличие);
			
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьСтатусыЗаказов(ПредопределенноеЗначение("Справочник.гф_СтатусРаботыСЗаказомИ5.ВыпущенаСпецификация"));
	
КонецПроцедуры // } #wortmann

// #wortmann {
// #Спецификация покупателя
// Галфинд Окунев 2022/07/05
//
// Параметры:
//
//   Отказ  		 - Булево
//
&После("ОбработкаУдаленияПроведения")
Процедура гф_ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
	УстановитьСтатусыЗаказов(ПредопределенноеЗначение("Справочник.гф_СтатусРаботыСЗаказомИ5.Подтвержден"));
	
КонецПроцедуры // } #wortmann

// #wortmann {
// #Спецификация покупателя
// Галфинд Окунев 2022/07/05
//
// Параметры:
//
//   Отказ  		 - Булево
//   РежимЗаписи  	 - РежимЗаписиДокумента
//   РежимПроведения - РежимПроведенияДокумента.
//
&После("ПередЗаписью")
Процедура гф_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	Партнер = Контрагент.Партнер;
	
	
	Если Не ПометкаУдаления Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	Счета = ПолучитьПроверитьСчетаНаОплату();
	
	Если Счета.Оплаченные.Количество() > 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По спецификации " +
		?(Счета.Оплаченные.Количество() > 1, "созданы и оплачены Счета", "создан и оплачен Счет") +
		" на аванс:");
		
		Для Каждого Счет Из Счета.Оплаченные Цикл
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Счет);
			
		КонецЦикла;
		
		Отказ = Истина;
		
	Иначе
		
		Для Каждого Счет Из Счета.Неоплаченные Цикл
			
			СчетОбъект = Счет.ПолучитьОбъект();
			
			Если Не СчетОбъект.ПометкаУдаления Тогда
				
				СчетОбъект.УстановитьПометкуУдаления(Истина);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // } #wortmann

// #wortmann {
// #Спецификация покупателя
// Галфинд Окунев 2022/07/05
//
// Параметры:
//
//   Отказ  		 - Булево
//
&После("ПриЗаписи")
Процедура гф_ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры // } #wortmann

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьСтатусыЗаказов(НовыйСтатусЗаказа)
	
	Для Каждого СтрокаЗаказа Из ЗаказыКлиентов Цикл
		
		Если СтрокаЗаказа.ЗаказКлиента.гф_СтатусРаботыСЗаказомИ5 <> НовыйСтатусЗаказа Тогда
			
			ЗаказОбъект = СтрокаЗаказа.ЗаказКлиента.ПолучитьОбъект();
			
			ЗаказОбъект.ОбменДанными.Загрузка = Истина;
			
			ЗаказОбъект.гф_СтатусРаботыСЗаказомИ5 = НовыйСтатусЗаказа;
			
			ЗаказОбъект.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // } #wortmann

// #wortmann {
// #Спецификация покупателя
// Галфинд Окунев 2023/06/18
//
// Возвращаемое значение:
//   - Массив
//
Функция ПроверитьСтатусыЗаказов(СтатусЗаказа)
	
	МассивОтличий = Новый Массив;
	
	Для Каждого СтрокаЗаказа Из ЗаказыКлиентов Цикл
		
		Если СтрокаЗаказа.ЗаказКлиента.гф_СтатусРаботыСЗаказомИ5 <> СтатусЗаказа Тогда
			
			МассивОтличий.Добавить(Строка(СтрокаЗаказа.ЗаказКлиента) +
			" статус «" + СтрокаЗаказа.ЗаказКлиента.гф_СтатусРаботыСЗаказомИ5 + "»");
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивОтличий;
	
КонецФункции // } #wortmann

// #wortmann {
// #Спецификация покупателя
// Галфинд Окунев 2023/06/18
//
// Возвращаемое значение:
//   - Структура
//
Функция ПолучитьПроверитьСчетаНаОплату()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	СчетНаОплатуКлиенту.Ссылка КАК Счет,
	|	ПоступлениеБезналичныхДенежныхСредств.Ссылка ЕСТЬ NULL
	|		ИЛИ ПоступлениеБезналичныхДенежныхСредств.ПометкаУдаления КАК МожноУдалять
	|ПОМЕСТИТЬ ВТ_Счета
	|ИЗ
	|	Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств КАК ПоступлениеБезналичныхДенежныхСредств
	|		ПО СчетНаОплатуКлиенту.Ссылка = ПоступлениеБезналичныхДенежныхСредств.ДокументОснование
	|ГДЕ
	|	СчетНаОплатуКлиенту.гф_СпецификацияПокупателя = &гф_СпецификацияПокупателя
	|	И НЕ СчетНаОплатуКлиенту.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетНаОплатуКлиенту.Ссылка,
	|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка ЕСТЬ NULL
	|		ИЛИ ПоступлениеБезналичныхДенежныхСредств.ПометкаУдаления
	|ИЗ
	|	Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств КАК ПоступлениеБезналичныхДенежныхСредств
	|			ПО ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка = ПоступлениеБезналичныхДенежныхСредств.Ссылка
	|		ПО СчетНаОплатуКлиенту.Ссылка = ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ОснованиеПлатежа
	|ГДЕ
	|	СчетНаОплатуКлиенту.гф_СпецификацияПокупателя = &гф_СпецификацияПокупателя
	|	И НЕ СчетНаОплатуКлиенту.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Счета.Счет КАК Счет
	|ИЗ
	|	ВТ_Счета КАК ВТ_Счета
	|ГДЕ
	|	НЕ ВТ_Счета.МожноУдалять
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Счета.Счет КАК Счет
	|ИЗ
	|	ВТ_Счета КАК ВТ_Счета
	|ГДЕ
	|	ВТ_Счета.МожноУдалять";
	
	Запрос.Параметры.Вставить("гф_СпецификацияПокупателя", Ссылка);
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	
	ИндексОплаченные   = 1;
	ИндексНеОплаченные = 2;
	
	РезультатОплаченные   = РезультатПакет[ИндексОплаченные];
	РезультатНеоплаченные = РезультатПакет[ИндексНеОплаченные];
	
	Если РезультатОплаченные.Пустой() Тогда
		
		Оплаченные = Новый Массив;
		
	Иначе
		
		Оплаченные = РезультатОплаченные.Выгрузить().ВыгрузитьКолонку("Счет");
		
	КонецЕсли;
	
	Если РезультатНеоплаченные.Пустой() Тогда
		
		Неоплаченные = Новый Массив;
		
	Иначе
		
		Неоплаченные = РезультатНеоплаченные.Выгрузить().ВыгрузитьКолонку("Счет");
		
	КонецЕсли;
	
	
	СчетаНаОплату = Новый Структура;
	
	СчетаНаОплату.Вставить("Оплаченные",   Оплаченные);
	СчетаНаОплату.Вставить("Неоплаченные", Неоплаченные);
	
	Возврат СчетаНаОплату;
	
КонецФункции // } #wortmann

#КонецОбласти
